#include <iostream>


int a = 2;
int* p = &a;							// створення вказ.(p), присвоєння йому значення адреси зм.(a)

int main() {
	int*pointer = p;					// створення вказ.(pointer), присвоєння йому значення адреси, на яку вказує вказ.(p)
	std::cout
		<< a << "\n"				    // вивод значення зм.(а)
		<< p << "\n"                    // вивод значення вказ.(р) - ( адреса зм.(а) )
		<< *p << "\n"                   // вивод значення зм.(а) - ( знаходиться по адресі вказ.(р) )
		<< pointer		                // вивод значення вказ.(рointer) - ( значення вказ.(р) )
		<< "\n\n";
	
	// Нульовий показник
	int* p1(0), *p2;                 
	int* pointer1=0;
	p2 = 0;
	int* p3(NULL);
	std::cout << p1 << "\n"
		<< pointer1 << "\n"
		<< p2 << "\n"
		<< p3
		<< "\n\n";

	// void показник - може вказувати на будь-який тип
	int a = 1;
	float b = 2;
	struct NF {
		int n = 3;
		float f = 4;
	} c;
	void* ptr = &a, * ptr1 = &b, * ptr2 = &c;
	std::cout << ptr << "\n"
		<< ptr1 << "\n"
		<< ptr2
		<< "\n\n";

	// & - оператор адреси
	std::cout << a << std::endl;
	std::cout << &a;

}